[
  {
    "": 1,
    "Origin": "1-1.jpg",
    "OriginB": "1-2.jpg",
    "PngW": "1-3.png",
    "PngB": "1-4.png",
    "Street": "1.jpg",
    "Object": "Shaver",
    "Hint": "It is a job responsible for simple haircutting.",
    "Storyteller": "Fu Qiang",
    "Story": "Shaving is an ancient profession, and the masters live by the skills that they learn from shaving. There are ten masters with ten different hairstyles. It is hard to find any young people doing this job. The master's craft is also different, from observing their skills. They had metaphors, like dancing on the tip of the knife, the human head moving knife and the neck dance sword general that caused quite a few thrills. The shavers understood that if someone wanted their hair shaved off that the hair itself was no more and that they had no room to mess it up, if it didn’t go the way they wanted it to.   The razor is meant to be used skillfully, and if the person doesn’t know what they are doing it can cause the person who is getting their head shaved to have a bleeding scalp. So, a seemingly simple human head requires a lot of prior knowledge in order for the hair to look handsome and well taken care of.  It also possesses a spirit because shaving is a learning process. \nI miss the sound of the pusher, Cluck! Cluck!,  in the ear when they are shaving the hair; I miss lying on the shaving chair, half asleep, and listening to the sound of the razor, Sizzle! \"; I miss when the shaver was finished shaving, causing my head to loosen. I also miss hearing “Done” sound when they were using their different machines, and the popping sound from them throwing the towel they used because it had the sound of crunchy weightlessness."
  },
  {
    "": 2,
    "Origin": "2-1.jpg",
    "OriginB": "2-2.jpg",
    "PngW": "2-3.png",
    "PngB": "2-4.png",
    "Street": "2.jpg",
    "Object": "Shoulder pole",
    "Hint": "It is a tool that is used for transportation.",
    "Storyteller": "Grandpa Liu",
    "Story": "The shoulder pole was arguably the most used tool in the past, and every household had to use a pole plus a basket to lift things. Without a pole, the farmer had no way of transporting their items. The pole represented the economic income of a family and also was the symbol of hope for a  family. In the past, every family had to have two to three poles at home, and some families had to borrow poles from other households.  Therefore, the shoulder pole became a bridge of communication between neighbors.\n\n\"In 1970, when I was just 19 years old, the governor called on the people of the county to come into the ‘Three Rivers All The Way’ construction.  I signed up for this job. The rivers I (started to lift)  were the Dongsheng River, the Hongqi River, and the Far East River ...... more than 20 rivers!\" Grandpa proudly said.\n\"With these ditches, droughts can be irrigated, floods can be drained, and crops can be harvested year after year.”\n\"In those days, everyone had a fixed amount of dirt to lift each day. Just after dawn, we got up to lift the dirt and kept lifting until we couldn't see our hands at night, then we went back to sleep."
  },
  {
    "": 3,
    "Origin": "3-1.jpg",
    "OriginB": "3-2.jpg",
    "PngW": "3-3.png",
    "PngB": "3-4.png",
    "Street": "3.jpg",
    "Object": "Cobbler",
    "Hint": "Job of mending shoes.",
    "Storyteller": "Uncle Xu",
    "Story": "In the past, people's standard of living was, generally,  not high.  They wore clothes and shoes that were \"new for three years, old for three years, (and) mended for another three years\". In the era of material scarcity, if shoes were broken, people generally had to repair and mend them several times, and then wear them for three to five years before they were willing to lose them. Especially in families with more children, a pair of shoes were always mended until they could  no longer be mended before they were thrown away.\n\nAt this point, it was the shoemaker's turn to make an appearance. The shoemaker would cut a suitable piece of leather, according to the size of the hole in the shoe, and use an awl to first make an eye, then put the thread of the shoe with a needle and sew it up stitch by stitch. If the shoe is leaning on the sole, you also have to sew the leather and the sole together, and the finished shoe looks both flat and beautiful."
  },
  {
    "": 4,
    "Origin": "4-1.jpg",
    "OriginB": "4-2.jpg",
    "PngW": "4-3.png",
    "PngB": "4-4.png",
    "Street": "4.jpg",
    "Object": "Broom",
    "Hint": "Broom made by sorghum spikes with rice grains.",
    "Storyteller": "Fu Jinghua",
    "Story": "My hometowns are  Fu Li Village, Yanshan County, and Cangzhou City. I don't know how long our village has been processing brooms, but I only know that since I was a child, our village was a broom processing village, and every family produced brooms, and all men and women were craftsmen. When the finished products were made, apart from riding bicycles to the nearby market to sell them, wholesalers would come to the village every now and then to buy them. The initial retail price of a broom for sweeping the floor was more than one dollar, but later rose to two or three dollars. This was the business that rural people depended on at that time.\n\nThe head of the broom is made of sorghum spike grain, with more than 50 cm of thin rod. This broom is a little clumsy, not very beautiful, but very durable.  It lasts at least a year or more. Now, plastic brooms cost more than ten dollars and take less than half a year to break down."
  },
  {
    "": 5,
    "Origin": "5-1.jpg",
    "OriginB": "5-2.jpg",
    "PngW": "5-3.png",
    "PngB": "5-4.png",
    "Street": "5.jpg",
    "Object": "Weigh scale",
    "Hint": "It is used to weigh items by balancing pole.",
    "Storyteller": "Liu Xing",
    "Story": "My family has been using this scale for more than 40 years. One end of the scale has an iron hook to hang things, and the other end has a weighted scale that is used to see the weight. In the past, it was essential to buy and sell food, oil, meat and vegetables. In addition to weighing things normally, this scale also weighed  my father and I when we were a few months old. Looking at the scale with obvious rust stains, I asked my grandfather, \"Nowadays, electronic scales are very convenient and accurate, this scale is rusted, why do you still keep it?\" Grandpa said, \"What if the electronic scale runs out of power?\" I thought this might be the sentiment of the older generation. By using this weight scale, Grandpa was honest in all his sales and never stole any money. What is weighed on the scale is not only the weight of the object, but also the weight of honesty!"
  },
  {
    "": 6,
    "Origin": "6-1.jpg",
    "OriginB": "6-2.jpg",
    "PngW": "6-3.png",
    "PngB": "6-4.png",
    "Street": "6.jpg",
    "Object": "Thermos",
    "Hint": "Used to save hot water.",
    "Storyteller": "Wang Zhijun",
    "Story": "I remember a time when I was traveling, from Chengdu, Sichuan Province on a passenger bus to Changdu, Tibet. It was for five days out of the week, every morning at seven o'clock out of the car to seven o'clock in the evening I had to park and eat my meals since I  only had one meal a day. At this time, the kettle came in handy because when I was hungry, I could take out instant noodles, put them into the bowl, pick up the kettle and pour water, wait a while to eat; when I was thirsty, I used it for drinking too; sometimes the bus traveled to the top of the mountain, and when I was feeling cold, I put it into my bosom. At home, when the children had stomach diarrhea, I would put it on their navel, and soon, they would have relief. At that time, the kettle was welcomed and loved by everyone in my house. Since then, I've been with it day and night, getting along with it and I have established a deep affection for it."
  },
  {
    "": 7,
    "Origin": "7-1.jpg",
    "OriginB": "7-2.jpg",
    "PngW": "7-3.png",
    "PngB": "7-4.png",
    "Street": "7.jpg",
    "Object": "Corn cob",
    "Hint": "Used to start a fire.",
    "Storyteller": "Du Xiaoshi",
    "Story": "I live in a northern city, and our main crop is corn. Every year, during the corn harvest season, we pile mountains of corn cobs together.  After the cobs are dried, we thresh the corn and preserve it. The corn cobs left over from the threshing are called corn bones in our region. Many farmers pile the corn cobs in a small barn and save them for the fires that happen in the winter.\n\nThe dried corn cob is particularly good, the smoke is not too big after they burn, and the price is not very expensive. So,  it is usually used as a kindling for the fire."
  },
  {
    "": 8,
    "Origin": "8-1.jpg",
    "OriginB": "8-2.jpg",
    "PngW": "8-3.png",
    "PngB": "8-4.png",
    "Street": "8.jpg",
    "Object": "Rattan chair",
    "Hint": "A chair made of rattan.",
    "Storyteller": "Zhang Yuhan",
    "Story": "It's so beautiful,\" Grandma exclaimed with excitement as she cautiously stroked her smooth and shiny rattan chair. The rattan chair was made of long and thin bamboo with two handles on the side. I always pestered my grandmother about the story of the rattan chair, and she always said she would tell me when I grew up. That day, grandma slowly said, with deep emotion, \"This rattan chair is your great grandmother’s. She saved  a month’s worth of money in order to buy it for me. It was,  very expensive when I was a child. It’s my old fellow.\"\n\"Hey, the sun is really good today,\" Grandma said, pulling the rattan chair carefully to her small yard. After she did that, she grabbed a pair of her shoes from the shoe board,  put on her old-fashioned glasses, took an embroidery needle and started sewing, and was ready to make me a pair of slippers. Grandma sat on a wicker chair and took the needle and put it through a hole, again and again,   carefully and tirelessly sewing the soles of the shoes. Everything was so beautiful: The warm sunlight shined down on her, accompanied by the rattling sound of the rattan chair."
  },
  {
    "": 9,
    "Origin": "9-1.jpg",
    "OriginB": "9-2.jpg",
    "PngW": "9-3.png",
    "PngB": "9-4.png",
    "Street": "9.jpg",
    "Object": "Pressure pot",
    "Hint": "Pressure cooker for quick stews.",
    "Storyteller": "Qian Shenhou",
    "Story": "Decades have passed, and I have moved several times, but this pressure cooker has never been thrown away by my mother. Although it looks a little different, and even a little ugly, with the wide variety of pots and pans available today, it still works well. When we were small, Mom often used it to give us rib stew to eat.  I miss the moments where I would open the lid, when I was a child, and out would come the smell from the thick meat flavor. Although there are  a variety of pots that seem to be both powerful and dazzling, that are here to help me make the meat, it no longer has the taste of my childhood memories."
  },
  {
    "": 10,
    "Origin": "10-1.jpg",
    "OriginB": "10-2.jpg",
    "PngW": "10-3.png",
    "PngB": "10-4.png",
    "Street": "10.jpg",
    "Object": "Shoe mold",
    "Hint": "Paper molds for making shoes.",
    "Storyteller": "Anonymous",
    "Story": "Some time ago, I went back to my hometown in the countryside to visit my relatives, and when I was packing up my things, I found two thick old books bulging with paper.  When I opened them, I saw that they were paper shoe samples used by my mother to make cloth shoes.  There were dozens of sets of them that were neatly clamped inside the two old books.\n\nWhen I was young, in the early 1970s, people didn't have money to buy shoes, so rural women made their own cloth shoes to wear. My mother was an expert in making cloth shoes by hand in the village, and the shoes she made were beautiful and comfortable to wear. When neighbors were making shoes, they would often come to our house and ask our mother to trace the shoe pattern, or ask her for advice on how to make the shoes. Whenever this happened, my mother would teach them by hand, patiently and carefully explaining the secret behind making good shoes. We all wore such cloth shoes made by our mother in those days."
  },
  {
    "": 11,
    "Origin": "11-1.jpg",
    "OriginB": "11-2.jpg",
    "PngW": "11-3.png",
    "PngB": "11-4.png",
    "Street": "11.jpg",
    "Object": "Steamer",
    "Hint": "Made of bamboo, used to steam buns tools.",
    "Storyteller": "Xie Fangjing",
    "Story": "I still remember how in the old days there was a store that made steamers in the North Gate of the county.   The owner was surnamed Miao, but folks used to call him Master Miao.\nMaking a steamer is a delicate handicraft job, and one must have a handy craftsman's heart in order to do it. The material he used was thatched bamboo from the mountains, and the bamboo material purchased needed to meet the standards for making steamers.  It couldn’t be too large, small, thick, or thin. After the material was taken, it was  first split into  long, one-centimeter-thick, pieces, and both sides were smoothed to look flat. Then, it was  placed onto red charcoal, dried while bending it into a diameter-sized circle by hand, and then fixed with rattan at its joints. The middle bottom is made of bamboo pieces interwoven in horizontal and vertical directions to form a caged drawer. They were stacked tightly, one by one, to prevent steam leakage. Finally, the bamboo steamer was covered with a bamboo lid to make it a complete bamboo steamer."
  },
  {
    "": 12,
    "Origin": "12-1.jpg",
    "OriginB": "12-2.jpg",
    "PngW": "12-3.png",
    "PngB": "12-4.png",
    "Street": "12.jpg",
    "Object": "Paper stamps",
    "Hint": "A kind of voucher for food purchase.",
    "Storyteller": "Chen Xinlian",
    "Story": "Food stamps and oil stamps were only available to urban households, and at that time they were divided into two types: national and local. Only national food stamps were valid in China. People who went on business trips had to go to a grain store with a letter of introduction from their unit to exchange a certain number of national food stamps.\nMy story with food stamps is twofold: one is that as a rural child who went to university, the household registration was changed from rural to urban, and there was the happiness of having food stamps; the other is that a colleague introduced me to a person  at that time, saying that he was working in a grain control office and was very popular. So, there was the heartwarming feeling of meeting this person that my colleague spoke about. After the interaction, he said, \"I can't guarantee that you eat well, but I will make sure that you can eat enough\", and showed me the Shanghai food stamps and national food stamps that he had saved. For this reason, he became my current husband."
  },
  {
    "": 13,
    "Origin": "13-1.jpg",
    "OriginB": "13-2.jpg",
    "PngW": "13-3.png",
    "PngB": "13-4.png",
    "Street": "13.jpg",
    "Object": "Dry meat",
    "Hint": "A way to preserve meat for a long time.",
    "Storyteller": "Li Jingsheng",
    "Story": "Dry meat is a way of storing fresh meat in the south. Bacon is about the selection of materials, and it should be fatty and lean. Lean meat will taste like firewood and be hard to chew and swallow. After the selection of materials, it was cut into strips, smeared with wine, salt, and star anise and other spices mixed with powder, then it was pickled for 3 to 5 days, after it was taken out of the stove where it smoked. When it is served, the bacon is cut into one-inch pieces and steamed in a rice steamer;  when the rice is cooked, the meat is also cooked. When I was young, two slices of bacon and a bowl of rice was simple meal."
  },
  {
    "": 14,
    "Origin": "14-1.jpg",
    "OriginB": "14-2.jpg",
    "PngW": "14-3.png",
    "PngB": "14-4.png",
    "Street": "14.jpg",
    "Object": "Coal oil lamp",
    "Hint": "A tool used for illumination.",
    "Storyteller": "Xie Lao",
    "Story": "My hometown is on the dry plateau of Weibei in Guanzhong, Shaanxi Province. In the days when there was no electricity, my ancestors relied on oil lamps for lighting. At first, the oil lamps were filled with cooking oil (i.e. vegetable oil, grapeseed oil, etc. ), but later coal oil became more economical than kerosene and soon replaced it.\nWhen I was in elementary school, there was still no electricity in my hometown. At that time, after school was over for the day, children had to help adults finish some of their work before it got dark. We did this by either hogging grass, collecting firewood, or doing other odd jobs that they could do, but didn’t have the time to complete. Occasionally, when the adults did not arrange work, they played with their peers until dark. The homework that was assigned by my  teachers had to be written by a coal oil lamp. The good thing was that the homework was very little, only three or two lines of writing per day, and it could be finished quickly. In order to save fuel, the family usually lit only one coal oil lamp. This lamp was mainly used to protect the mother's work that usually consisted of spinning, weaving, and doing needlework. At that time, rural areas were all collectively laboring, and they had to work in unison during the day, and only at night could they do their own work at home. All the clothes, hats, shoes and socks of the families  were spun, woven, cut, and sewn by my mother. Throughout the year, almost every night, my mother was busy with these things. At that time, I often fell asleep listening to the sound of the fire burning when the wind blew."
  },
  {
    "": 15,
    "Origin": "15-1.jpg",
    "OriginB": "15-2.jpg",
    "PngW": "15-3.png",
    "PngB": "15-4.png",
    "Street": "15.jpg",
    "Object": "Family’s stove",
    "Hint": "A Dry clay stove for raising fire.",
    "Storyteller": "Qiuli Ping",
    "Story": "When I was a child, my parents would take me to my grandmother's house every holiday, and I remembered the most heartwarming picture of my childhood: a family sitting around the kitchen stove, chattering together and doing chores together.\n\n I loved sitting next to my grandfather, watching him build the fire, adding wood. I would help my grandfather burn the stove, and he always got onto me out of fear that I would hurt myself. I loved my grandmother's secret weapon, the tile pot. My grandmother often put food in the tile pot and then put the tile pot in the stove causing the wood ash to slowly simmer. The small side of the stove carries my childhood which is full of memories."
  },
  {
    "": 16,
    "Origin": "16-1.jpg",
    "OriginB": "16-2.jpg",
    "PngW": "16-3.png",
    "PngB": "16-4.png",
    "Street": "16.jpg",
    "Object": "Baby carriage",
    "Hint": "A means of transportation made of woven bamboo.",
    "Storyteller": "Anonymous",
    "Story": "I was brought up by my grandmother in my childhood. My grandmother’s figure is deeply engraved in my memory: She had short, white hair, eyes that had a kind gaze, and deep sunken eye sockets. I vaguely remember that she would always carry me to the car with her wrinkled hands and push me out of the house. I was loved deeply by my grandmother. She used to push the child's bamboo cart around, with her beloved me inside, and a bag full of snacks in her hand."
  },
  {
    "": 17,
    "Origin": "17-1.jpg",
    "OriginB": "17-2.jpg",
    "PngW": "17-3.png",
    "PngB": "17-4.png",
    "Street": "17.jpg",
    "Object": "Movie projector",
    "Hint": "The projector that reads film tapes.",
    "Storyteller": "JI Youguan",
    "Story": "Growing up watching open-air movies, I thought the movie projector was really a magical object. As the movie projector clicked and turned, different scenes appeared on the white curtain. We took our seats early after dinner and waited with great anticipation for the open-air movie to start. This was a common scene in the 1970s and 1980s in various towns of Pingtan. At that time, watching movies was just like a festival, and every day, when the movie was shown, villagers would gather in front of the open space and wait for the movie to start. Even though the films were crude and the storylines were simple, it was not until the movie ended that some villagers got up and left their seats and went back home along the village road in pairs, talking loudly about the content of the film along the way."
  },
  {
    "": 18,
    "Origin": "18-1.jpg",
    "OriginB": "18-2.jpg",
    "PngW": "18-3.png",
    "PngB": "18-4.png",
    "Street": "18.jpg",
    "Object": "Lime stones",
    "Hint": "A pen that can draw everywhere.",
    "Storyteller": "Anonymous",
    "Story": "When I was young, the most fun I had was when I would find a stone pen that could write on the ground and walls. You could find them on the grounds of some factory sites, and some even in the surrounding land. If you looked during the afternoon, you could find about two or three small pieces of stone. In the opinion of the adults, this was just an ordinary stone, while in our group of children, it was much more valuable than gold bars."
  },
  {
    "": 19,
    "Origin": "19-1.jpg",
    "OriginB": "19-2.jpg",
    "PngW": "19-3.png",
    "PngB": "19-4.png",
    "Street": "19.jpg",
    "Object": "Newsstand",
    "Hint": "The bookstore down the street.",
    "Storyteller": "Gui Xiaoshu",
    "Story": "The newsstand appeared in the early 1980s. At the time, a  newsstand was a green hut, which mostly had three windows and doors on one wall. There was only a small space in the house to put down a chair, and there were many newspapers and magazines piled up next to it. Every morning, newspaper sellers went inside. Three of its windows and all of its doors would be open, which formed three walls. Looking up and down, high and low, left and right, someone could see that there hung a variety of colorful magazines. The newsstand was like a telescope  that allowed us to learn about the outside world at home. There was a small window and a counter on the front, with a variety of newspapers. The newspaper sellers collected money for a short exchange with the newspaper buyers."
  },
  {
    "": 20,
    "Origin": "20-1.jpg",
    "OriginB": "20-2.jpg",
    "PngW": "20-3.png",
    "PngB": "20-4.png",
    "Street": "20.jpg",
    "Object": "Trolley bus",
    "Hint": "An bus is powered by an unconventional method",
    "Storyteller": "Cai Xiaojin",
    "Story": "The tram driver's greatest fear is to drop the tail when they encounter road bumps. Having just driven a tram for two years, I was standing in sweat every time I encountered this situation. \nIn order to minimize the tail situation, the bus driver at the time (before officially starting work) must be familiar with the three rules.  Cai Xiaojin introduced the so-called pre-service three rules , which were the parallel line, the line separation, and the knotted line. For example, when it comes to parallel lines, you must not apply the brakes; with separation lines, some points require that the driver speed up to drive through, some points need to be slowly driven through; knotted lines must be slow to pass."
  },
  {
    "": 21,
    "Origin": "21-1.jpg",
    "OriginB": "21-2.jpg",
    "PngW": "21-3.png",
    "PngB": "21-4.png",
    "Street": "21.jpg",
    "Object": "Copper Stove",
    "Hint": "Pots made of melted copper.",
    "Storyteller": "Chen Guihua",
    "Story": "I remember when I was a child there was an electrical factory in front of my house. Every day they would produce a lot of garbage. The garbage was mixed with a large amount of copper scrap. Every day, after school, my family and I  went to pick up the copper scrap, then went to the store, and burned it into a copper stove.\n\nSince the family who owned the store had a copper foot stove, the cold winter added a lot of warm memories. Their family sat around the foot stove, taking turns warming their feet, warming their bodies up against the heat, laughing and joking. From time to time, the stove also gave off a  tempting aroma. At that time, there was a lack of materials, and the family only grew beans, so we often put a handful of soybeans in the foot stove to bake, and a while later we could hear the crackling sound, and the aroma came to our nostrils, and we were not afraid of being hot, and we grabbed the first of the soybeans to eat."
  },
  {
    "": 22,
    "Origin": "22-1.jpg",
    "OriginB": "22-2.jpg",
    "PngW": "22-3.png",
    "PngB": "22-4.png",
    "Street": "22.jpg",
    "Object": "Bingtanghulu",
    "Hint": "A snack made of hawthorn and maltose syrup.",
    "Storyteller": "Wang Xilou",
    "Story": "When I was a child, from time to time, there would be grandparents or grandmothers selling ice gourds on the street, holding a long wooden stick with many Bingtanghulu stuck on it. When I was a child, a  hawthorn made of Bingtanghulu gourd, a small five hawthorn, sold for 50 cents, and a large one made of ten hawthorn sold for a dollar. We children, with more pocket money, would buy a dollar of Bingtanghulu, which was not enough money to buy 50 cents worth of food."
  },
  {
    "": 23,
    "Origin": "23-1.jpg",
    "OriginB": "23-2.jpg",
    "PngW": "23-3.png",
    "PngB": "23-4.png",
    "Street": "23.jpg",
    "Object": "Jumping rope",
    "Hint": "A multiplayer game for 3+ people.",
    "Storyteller": "Anonymous",
    "Story": "When I was little, after I finished my homework, I ran outside to find other kids to play jump rope. The jump rope would t be at least three meters long. Before playing, we tied the ends of the rope with a knot, then two people were inside of the rope’s circle. From there, the rope would be propped up, and the third person can jump the belt. There were many ways of jumping the rope, but I did not know who taught it to whom. We have a fixed way of jumping, both feet from the rope to jump outside the rope, one foot into the rope hooked up the other side of the rope, bounce, and step on the rope. If you do not step on the rope, then you lose."
  },
  {
    "": 24,
    "Origin": "24-1.jpg",
    "OriginB": "24-2.jpg",
    "PngW": "24-3.png",
    "PngB": "24-4.png",
    "Street": "24.jpg",
    "Object": "Public phone",
    "Hint": "Pay phones for public use",
    "Storyteller": "Wu WeiJie",
    "Story": "When people see hear the beeper ring, people would go straight to the public telephone booth. I always go to the paging desk to call the attendant, though I had used the beeper to call or leave a message to my mother. I would always ask her, \"Mom, back from dinner today?\" At that time, my voice hadn’t during puberty. Although I was a man, the woman at the paging desk called me \"Sister Wu\". She thought that I was a little girl, based on my voice. Now, I laugh out loud when I think back on it."
  },
  {
    "": 25,
    "Origin": "25-1.jpg",
    "OriginB": "25-2.jpg",
    "PngW": "25-3.png",
    "PngB": "25-4.png",
    "Street": "25.jpg",
    "Object": "Play Xiangqi",
    "Hint": "Elderly people often play this game.",
    "Storyteller": "Anonymous",
    "Story": "My grandfather was a chess fanatic and often didn't come home until 6:00 at night. One time, my grandmother asked me to go get my grandfather for dinner, so I turned around and found him by a small lake in a park. He was holding a chess piece in his left hand and his eyes were glued to the board. When I saw this, I shouted to him, \"Grandpa, Grandma wants you to come home for dinner!\" He didn't seem to hear me, but he was still staring at the chessboard. I shouted again several times, and one of the people playing chess with grandpa said to him, \"Your daughter is calling you home for dinner, didn't you hear her?\" Only then did he come back to his senses, waved his hand at me, and said, \"I know! Got it! I'll be right home!\" I went home and said to my grandmother, \"Grandpa said he'll be home soon.\" But Grandma said, \"Your grandpa will be home at six o'clock.\" Sure enough, it was almost six o'clock when Grandpa came running back in the dust. Before Grandma could say anything, Grandpa said, \"I've won two more games today!"
  },
  {
    "": 26,
    "Origin": "26-1.jpg",
    "OriginB": "26-2.jpg",
    "PngW": "26-3.png",
    "PngB": "26-4.png",
    "Street": "26.jpg",
    "Object": "Bird cages",
    "Hint": "A woven bamboo cage for taking birds out.",
    "Storyteller": "Xiao Ming",
    "Story": "Bird walkers are the earliest walkers at the start of the day. When the sun is just rising, many old people can be seen walking birds in gardens and in some open spaces. They walk slowly with bird cages in their hands, and as they walk the cage swings back and forth. Some of them come on foot, and more of them come by bicycle. The tones of the birds' calls come in a variety of sounds. Some are wide and bright, some are narrow and high."
  },
  {
    "": 27,
    "Origin": "27-1.jpg",
    "OriginB": "27-2.jpg",
    "PngW": "27-3.png",
    "PngB": "27-4.png",
    "Street": "27.jpg",
    "Object": "Calendar",
    "Hint": "It is a way to remember the day.",
    "Storyteller": "Zhang Zhenhan",
    "Story": "When I was a child, I liked to fight with my brother to flip through the calendar hanging on the wall, which my father bought for one or two yuans at the market. I remember my father would buy one every New Year's Day and staple it to the wall where my brother and I could reach.\nWhenever there were only two or three pages left on the wall calendar, I always felt that time was long and I wanted to tear it up. My brother did not care what the calendar said, once the sun rose because he would  always go out to buy firecrackers. He would light them up in  rows, watching them go into the sun. This was his own unique way of thinking as a child, and what he did with the firecrackers had no scientific basis.  The last day of the year is spent remembering  the scene of my brother drying firecrackers and my father turning the calendar."
  },
  {
    "": 28,
    "Origin": "28-1.jpg",
    "OriginB": "28-2.jpg",
    "PngW": "28-3.png",
    "PngB": "28-4.png",
    "Street": "28.jpg",
    "Object": "TV",
    "Hint": "It looks like a microwave with a receiver.",
    "Storyteller": "Hu Gang Sheng",
    "Story": "A few days ago, I found an old photo at my grandmother's house. It was a picture of my mother with a microwave oven when I was a child. Mom laughed and said, \"This is not a microwave oven, this is a black and white TV set from when we were kids. At that time, the television set was particularly expensive.  Grandfather saved for a long time to buy this baby, so there were only one or two sets in the whole village.\nIn the evening, the kids would gather together with their little stools and wait for the TV program to start, which was even more lively than New Year's Eve! I took a closer look at this baby, it was  a rectangular box.  The front looked  like it was the size of two language books, the middle had  a small screen, the upper right corner had a few buttons to adjust the volume and switch the television set on and off, and the top had two reception signal antennas.  I thought that it was all  interesting! I heard from my mom that the TV only had two or three channels and the pictures were  blurry, but that didn't stop the kids from watching."
  },
  {
    "": 29,
    "Origin": "29-1.jpg",
    "OriginB": "29-2.jpg",
    "PngW": "29-3.png",
    "PngB": "29-4.png",
    "Street": "29.jpg",
    "Object": "Sewing machine",
    "Hint": "For fabric sewing.",
    "Storyteller": "Gu Mingdi",
    "Story": "When I was a student, all of the daily necessities were in short supply, and a piece of clothing was worn for several years, and when it broke, it was mended by sewing. When my clothes and pants broke, I sewed a flower on top. When my neighbors saw that I had sewn a flower to my top, they brought their pieces of clothing to my house to be sewn. I felt very proud and had a sense of accomplishment when I saw them wearing the clothes I had sewn."
  },
  {
    "": 30,
    "Origin": "30-1.jpg",
    "OriginB": "30-2.jpg",
    "PngW": "30-3.png",
    "PngB": "30-4.png",
    "Street": "30.jpg",
    "Object": "Well",
    "Hint": "A well is used for extracting groundwater.",
    "Storyteller": "Cheng Qian",
    "Story": "When I was a child, I vaguely remember that there was a public well at the center of the village. Every day at dawn, my father would go and get a bucket early in order to get water from the well. He would pick water four or five times every morning to fill our small water jar with water.\nI remember my father holding the hook at one end of the stretcher with both hands and hanging the bucket at the other end, slowly putting the bucket on the water surface of the well, shaking his hand, sending it down with force, and then bringing it upward with force. The empty bucket was turned over and filled with water in a few seconds. Every day, the road from the village to the well was always wet."
  },
  {
    "": 31,
    "Origin": "31-1.jpg",
    "OriginB": "31-2.jpg",
    "PngW": "31-3.png",
    "PngB": "31-4.png",
    "Street": "31.jpg",
    "Object": "Arcade game",
    "Hint": "A game machine with a small screen on it.",
    "Storyteller": "Lao Qiao",
    "Story": "The first time I played arcade games, I was taken there by my neighbor's older brother. I did not feel excited at first, but after a few more rounds, my enthusiasm for video games suddenly rose, and I gradually became obsessed to the point that even sometimes my fingers would  gesticulate during class. After that, I often took my buddies to the neighborhood to play games, which gradually developed into an extracurricular activity in our leisure time.\nEvery Friday, we would make a date to go play a game together in the evening. After dinner, around 7 pm, we would meet in front of the neighborhood. On the way to the arcade, we would talk about the different characters in the game and decide what game we would play later. We all preferred to play multiplayer games over combat games because we felt that they were more fun."
  },
  {
    "": 32,
    "Origin": "32-1.jpg",
    "OriginB": "32-2.jpg",
    "PngW": "32-3.png",
    "PngB": "32-4.png",
    "Street": "32.jpg",
    "Object": "Cassette tape",
    "Hint": "Used as with music playback.",
    "Storyteller": "Xie Jing",
    "Story": "Cassettes, also called tapes or videotapes, need to be put into an old tape recorder in order to be played, which was the most popular way to play music in the 1980s. Each cassette had a beautiful cover with portraits of singers and was only sold in special audio stores. Although these songs do not have the sound quality of digital music nowadays,, this wonderful memory will forever remain in my heart."
  },
  {
    "": 33,
    "Origin": "33-1.jpg",
    "OriginB": "33-2.jpg",
    "PngW": "33-3.png",
    "PngB": "33-4.png",
    "Street": "33.jpg",
    "Object": "Coal seller",
    "Hint": "Coal was the main household fuel in the 1950s.",
    "Storyteller": "Xin Ming",
    "Story": "I remember there was a grandfather named Zhao in the village who would pull a long wooden wheelbarrow with hundreds of coal cakes stacked on it every day. He pulled a cart of honeycomb coal to go around the village, calling out \"selling honeycomb coal\" along the way. The weight of this cart is not light, a cart full of honeycomb coal, he pulled up very hard just by holding the handle of wheelbarrow, so he had to put a wide strap on his shoulder. Because we often see him on the way to and from school, whenever we encounter too much honeycomb in his car, my buddies and I always push him a little. And when he had a good business and sold out of a cart of coal, he would invite us to get on his coal cart and take us for a ride."
  },
  {
    "": 34,
    "Origin": "34-1.jpg",
    "OriginB": "34-2.jpg",
    "PngW": "34-3.png",
    "PngB": "34-4.png",
    "Street": "34.jpg",
    "Object": "Homemade table",
    "Hint": "The game field built with tables and boards.",
    "Storyteller": "Mo Zuning",
    "Story": "When I was a kid, a group of us kids drew lines on the ground and put a few bricks in the middle to make a net, and that was our earliest ping pong table. And ping pong paddles? We could even use our textbooks as ping pong paddles.\nMy father knew I loved to play ping pong and made a ping pong paddle out of a wooden board. My father knew the art of woodworking and made a very beautiful ping pong paddle. The ping pong balls bounced and thumped on it with a very crisp sound. Unfortunately, when I was young and lazy in my studies, my father used the ping pong paddle to spank me when I failed a test and the ping pong paddle broke into two pieces."
  },
  {
    "": 35,
    "Origin": "35-1.jpg",
    "OriginB": "35-2.jpg",
    "PngW": "35-3.png",
    "PngB": "35-4.png",
    "Street": "35.jpg",
    "Object": "Juggling show",
    "Hint": "A kind of performance that is only available during the holiday season.",
    "Storyteller": "Fan Fengxue",
    "Story": "For as long as I can remember, going to the show has been something I've longed for. The greatest joy of my childhood was to follow adults and buy food at the market, following along while watching the performances on the street.\n\nThere were all kinds of performances such as juggling, tightrope stepping and topping boards. When I was a kid, I thought these performers had magic powers. A section of wire was set up in the air, and people walked on it as if they were walking on the ground, and people could perform various movements. People's mouths, foreheads, shoulders, hands, can simultaneously lift a stack of plates held up by a wooden stick. These magical episodes made me, as a child, watch with fascination."
  }
]